{
    "en": {
      "title": "Software Developer",
      "bio": "I am a former lecturer and researcher now building a new career as a software/web developer. My interest in development is long-standing and I taught myself programming earlier in my career. I learn extremely quickly and am passionate about making a meaningful contribution in everything I do.",
      "contact": "Contact",
      "skills": "Skills",
      "experience": "Experience",
      "jt1": "Intern",
      "emp1": "Studentlitteratur | May-June 2024, Jan-May 2025",
      "jd1": "As the final part of my current education I worked on both front- and backend aspects of Studora, Studentlitteratur's study platform, including new AI features.",
      "jt2": "Lecturer in English",
      "emp2": "Lund University (and other universities) | 2017-2023",
      "jd2": "My research career has made me comfortable with working independently on complex projects. I am always open to new knowledge and happy to share my own, and I have a proven track record as an inspiring teacher and colleague.",
      "jt3": "Business Analyst",
      "emp3": "MHP, London | 2002-2006",
      "jd3": "Responsible for producing and presenting statistical reports to the board, employees, and regulatory authorities. I also worked closely with the development team.",
      "jt4": "Senior Editor",
      "emp4": "WARC, Henley-on-Thames | 1999-2002",
      "jd4": "I took a lead in utilising technology to make production processes more efficient. I taught myself to write complex macros in Visual Basic to speed up publication of WARC's statistical products.",
      "country": "Sweden",
      "ed": "Education",
      "ed_t1": "Fullstack development",
      "ed_sch1": "Teknikhögskolan, Lund | 2023-2025",
      "ed_d1": "Practical education focused on development in JavaScript, also covering HTML/CSS, and libraries such as React, jQuery, BootStrap, and Tailwind. The backend part of the course has covered node.js, Java, and Java Spring.",
      "ed_t5": "Introduction to AI with Python",
      "ed_sch5": "Harvard University | 2024",
      "ed_d5": "An online course covering various aspects of AI development, including machine learning and natural language processing.",
      "ed_t2": "PhD, English Literature",
      "ed_sch2": "Lund University | 2012-2017",
      "ed_d2": "My doctoral research dealt with representations of witchcraft in early modern English drama. My thesis was awarded the 2019 Warburg Prize by Kungliga Vitterhetsakademien, and was later published as a book.",
      "ed_t3": "MA, English Literature",
      "ed_sch3": "Lund University | 2009-2011",
      "ed_t4": "BA, Philosophy & Politics (class one)",
      "ed_sch4": "University of Warwick | 1996-99",
      "project_text": "This website is a hobby project designed to showcase both my programming skills and my small collection of rare/antique books, some of which are special to me because of my earlier research on the 16th & 17th centuries. It is built in Next 15, making full use of the app router. Instead of traditional API routes, interactions with the PostgreSQL database are handled using server components and server actions. The project also implements a chatbot based on the GPT-4o mini model. Please do take a minute to look around.",
      "links": "Links",
        "link1_title": "Google Scholar profile",
        "link1_text": "My academic publications",
        "link2_title": "GitHub page",
        "link2_text": "Various hobby projects",
        "link3_title": "CV",
        "link3_text": "Download my CV (English)",
        "link4_title": "Introduction to AI with Python",
        "link4_text": "Course certificate",
        "link5_title": "UR Play",
      "link5_text": "Lecture broadcast on Kunskapskanalen (2014)",
      "link6_title": "Soundcloud",
      "link6_text": "Interview at the Gothenburg book fair (2019)"
    },
    "se": {
      "title": "Mjukvaruutvecklare",
      "bio": "Jag har tidigare arbetat som universitetslektor och forskare som nyligen utbildat mig till utvecklare. Jag har länge varit intresserad av utveckling och lärde mig programmera på egen hand tidigare i karriären. Jag lär mig mycket snabbt och brinner för att göra skillnad i allt jag gör.",
      "contact": "Kontaktuppgifter",
      "skills": "Kompetenser",
      "experience": "Arbetslivserfarenhet",
      "jt1": "Praktik",
      "emp1": "Studentlitteratur | maj-jun 2024, jan-maj 2025",
      "jd1": "Som en del av min nuvarande utbildning jobbade jag på både front- och backend delar av Studora, Studentlitteraturs lärplatform, inklusiv den nya satsning på AI.",
      "jt2": "Universitetslektor i engelska",
      "emp2": "Lunds Universitet (och andra lärosäte)",
      "jd2": "Mångårig erfarenhet inom forskning har gjort mig mycket van vid att jobba självständigt med komplexa projekt. Jag dela gärna av mig kunskap och vill alltid lära mig mer. Jag har varit en mycket uppskattad och inspirerande lärare och kollega genom mitt universitetskarriär.",
      "jt3": "Analytiker",
      "emp3": "MHP, London | 2002-2006",
      "jd3": "Ansvarig för att producera och presentera statistiska rapporter till ledningsgruppen och personal samt myndigheter. Jobbade med kravställning mot utvecklare.",
      "jt4": "Senior redaktör",
      "emp4": "WARC, Henley-on-Thames | 1999-2002",
      "jd4": "Var drivande i att effektivisera publiceringsprocesserna. Lärde mig på egen hand att skriva komplexa macros i Visual Basic för att snabba på publiceringen av WARCs statistiska produkter.",
      "country": "Sverige",
      "ed": "Utbildning",
      "ed_t1": "Fullstackutvecklare",
      "ed_sch1": "Teknikhögskolan, Lund | 2023-2025",
      "ed_d1": "Praktisk utbildning med fokus på utveckling med JavaScript. Lärde även HTML/CSS, bibliotek som React, jQuery, BootStrap, och Tailwind. Backend del av kursen har täckt node.js, Java, och Java Spring.",
      "ed_t2": "Doktorsexamen, engelsk litteratur",
      "ed_t5": "Introduction to AI with Python",
      "ed_sch5": "Harvard University | 2024",
      "ed_d5": "Online utbildning som täckte olika aspekter av AI-utveckling, inklusive maskininlärning och naturlig språkbehandling (NLP).",
      "ed_sch2": "Lunds Universitet | 2012-2017",
      "ed_d2": "Min doktorsavhandling tog upp representationen av häxor inom det tidiga engelska dramat och belönades med Warburgska priset av Kungliga Vitterhetsakademien i 2019. Den gavs ut sedan som en bok.",
      "ed_t3": "MA, engelsk litteratur",
      "ed_sch3": "Lunds Universitet | 2009-2011",
      "ed_t4": "BA, Filosofi & Statsvetenskap",
      "ed_sch4": "University of Warwick | 1996-99",
      "project_text": "Den här webbplatsen är ett hobbyprojekt utformat för att visa upp mina programmeringsfärdigheter och min lilla samling av sällsynta/antika böcker, av vilka några är speciella för mig på grund av min tidigare forskning om 1500- och 1600-talen. Den är inbyggd i Next 15 och utnyttjar approutern fullt ut. Istället för traditionella  api-endpoints hanteras all interaktion med den PostgreSQL-databasen av serverkomponenter och server actions. Det finns även en chatbot baserad på GPT-4o mini modellen. Ta dig gärna tid att klicka runt.",
      "links": "Länkar",
      "link1_title": "Google Scholar profil",
      "link1_text": "Mina akademiska publikationer",
      "link2_title": "GitHub sida",
      "link2_text": "Olika hobbyprojekt",
      "link3_title": "CV",
      "link3_text": "Ladda ned mitt CV (svenska)",
      "link4_title": "Introduction to AI with Python",
      "link4_text": "Utbildningsbevis",
      "link5_title": "UR Play",
      "link5_text": "Föreläsning som sändes på Kunskapskanalen (2014)",
      "link6_title": "Soundcloud",
      "link6_text": "Intervju på Göteborgs Bokmässan (2019)"
    }
  }